app/Controllers/ProduitController.php

SELECT *
FROM `produits`
---
    public function index()
    {
        $data['produits'] = $this->produit->findAll();

INSERT INTO `produits` (`designation`, `prix`, `quantite_stock`) VALUES ('LAoka', '15000', '5000')
---
    public function store()
    {
        $this->produit->save([
            'designation'    => $this->request->getPost('designation'),
            'prix'           => $this->request->getPost('prix'),
            'quantite_stock' => $this->request->getPost('quantite_stock')
        ]);

SELECT *
FROM `produits`
WHERE `produits`.`id` = '5'
---
    public function edit($id)
    {
        $data['produit'] = $this->produit->find($id);

UPDATE `produits` SET `designation` = 'Pâtes Panzani 500g', `prix` = '3800', `quantite_stock` = '12'
WHERE `produits`.`id` IN ('5')
---
    public function update($id)
    {
        $this->produit->update($id, [
            'designation'    => $this->request->getPost('designation'),
            'prix'           => $this->request->getPost('prix'),
            'quantite_stock' => $this->request->getPost('quantite_stock')
        ]);

DELETE FROM `produits`
WHERE `id` IN ('6')
---
    public function delete($id)
    {
        $this->produit->delete($id);